packages/gantt-4.2.7-trial/examples/RoR/app/controllers/dependencies_controller.rb

  def index
    dependencies = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"