packages/gantt-4.2.7-trial/examples/RoR/app/controllers/tasks_controller.rb

      task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE (ParentId IS NULL)